In [5]:
# importamos la pandas para poder trabajar en la lección
import pandas as pd
import numpy as np

1.Es el turno de los DataFrames

Crea un array de dos dimensiones con 4 filas y 3 columnas.

Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

Descarga el archivo "medallas" y carga el DataFrame.

Usando el loc extrae todas las columnas de la fila de Tailandia.

Usando el loc extrae todas las columnas de China e Irán.

Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

Usando el iloc extrae la información de la India. Devolved todas las columnas.

Usando el iloc extrae todas las columnas de los países que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

Contesta a las siguientes preguntas:

¿Qué país consiguió más de 200 medallas de oro?

¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

Crea una nueva columna que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [ ]:
array1=np.empty((4,3))

In [14]:
names1=["España","Francia","Italia"]

In [53]:
df=pd.DataFrame(array1, columns=names1 )
df.head()

          España        Francia         Italia
0  2.419075e-312  2.058336e-312  1.039778e-312
1  2.334195e-312  9.761181e-313  2.312975e-312
2  2.461515e-312  8.487983e-313  9.336781e-313
3  8.700183e-313   6.530903e-38   5.644656e-38

In [54]:
df_medallas=pd.read_csv("archivos_pair/medallas.csv",index_col=0)
df_medallas

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

In [25]:
df_medallas.loc[7, :]

País      Tailandia
Oro             132
Plata           175
Bronce          278
Name: 7, dtype: object

In [26]:
df_medallas.loc[[1,4], :]

    País   Oro  Plata  Bronce
1  China  1473    994     720
4   Irán   179    181     197

In [ ]:
df_medallas.iloc[1::2,["Oro","Plata","Bronce"]]

    Oro  Plata  Bronce
1  1473    994     720
4   179    181     197

In [29]:
df_medallas.iloc[5, :]

País      India
Oro         154
Plata       202
Bronce      315
Name: 6, dtype: object

In [31]:
df_medallas.iloc[1::2,:]

               País   Oro  Plata  Bronce
2             Japón  1032   1037     985
4              Irán   179    181     197
6             India   154    202     315
8         Indonesia   112    131     240
10  Corea del Norte    91    120     235

In [33]:
df_medallas.iloc[1::2,[1,2,3]]

     Oro  Plata  Bronce
2   1032   1037     985
4    179    181     197
6    154    202     315
8    112    131     240
10    91    120     235

In [39]:
df_medallas.loc[df_medallas["Oro"]>200,"País"]

1            China
2            Japón
3    Corea del Sur
Name: País, dtype: object

In [42]:
df_medallas.loc[(df_medallas["Oro"]>200) & (df_medallas["Plata"] >1000), "País"]

2    Japón
Name: País, dtype: object

In [56]:
df_medallas.loc[(df_medallas["Oro"]>200) | (df_medallas["Bronce"] >700), "País"]

1            China
2            Japón
3    Corea del Sur
Name: País, dtype: object

In [55]:
df_medallas["Total"] = (df_medallas["Oro"] + df_medallas["Plata"] + df_medallas["Bronce"])
df_medallas

               País   Oro  Plata  Bronce  Total
1             China  1473    994     720   3187
2             Japón  1032   1037     985   3054
3     Corea del Sur   745    663     827   2235
4              Irán   179    181     197    557
5        Kazajistán   155    158     224    537
6             India   154    202     315    671
7         Tailandia   132    175     278    585
8         Indonesia   112    131     240    483
9      China Taipéi    99    144     276    519
10  Corea del Norte    91    120     235    446